kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
/* Register Addresses *******************************************************/

#define STM32H5_RCC_CR         (STM32H5_RCC_BASE +  STM32H5_RCC_CR_OFFSET)
#define STM32H5_RCC_HSICFGR    (STM32H5_RCC_BASE + STM32H5_RCC_HSICFGR_OFFSET)
#define STM32_RCC_CRRCR        (STM32H5_RCC_BASE + STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CFGR1        (STM32H5_RCC_BASE + STM32_RCC_CFGR1_OFFSET)
#define STM32_RCC_CFGR2        (STM32H5_RCC_BASE + STM32_RCC_CFGR2_OFFSET)
#define STM32_RCC_PLL1CFGR     (STM32H5_RCC_BASE + STM32_RCC_PLL1CFGR_OFFSET)
#define STM32_RCC_PLL2CFGR     (STM32H5_RCC_BASE + STM32_RCC_PLL2CFGR_OFFSET)
#define STM32_RCC_PLL3CFGR     (STM32H5_RCC_BASE + STM32_RCC_PLL3CFGR_OFFSET)
#define STM32_RCC_PLL1DIVR     (STM32H5_RCC_BASE + STM32_RCC_PLL1DIVR_OFFSET)
#define STM32_RCC_PLL1FRACR    (STM32H5_RCC_BASE + STM32_RCC_PLL1FRACR_OFFSET)
#define STM32_RCC_PLL2DIVR     (STM32H5_RCC_BASE + STM32_RCC_PLL2DIVR_OFFSET)
#define STM32_RCC_PLL2FRACR    (STM32H5_RCC_BASE + STM32_RCC_PLL2FRACR_OFFSET)
#define STM32_RCC_PLL3DIVR     (STM32H5_RCC_BASE + STM32_RCC_PLL3DIVR_OFFSET)
#define STM32_RCC_PLL3FRACR    (STM32H5_RCC_BASE + STM32_RCC_PLL3FRACR_OFFSET)
#define STM32_RCC_CIER         (STM32H5_RCC_BASE + STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR         (STM32H5_RCC_BASE + STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR         (STM32H5_RCC_BASE + STM32_RCC_CICR_OFFSET)
#define STM32_RCC_AHB1RSTR     (STM32H5_RCC_BASE + STM32_RCC_AHB1RSTR_OFFSET)
#define STM32_RCC_AHB2RSTR     (STM32H5_RCC_BASE + STM32_RCC_AHB2RSTR_OFFSET)
#define STM32_RCC_AHB4RSTR     (STM32H5_RCC_BASE + STM32_RCC_AHB4RSTR_OFFSET)
#define STM32_RCC_APB1LRSTR    (STM32H5_RCC_BASE + STM32_RCC_APB1LRSTR_OFFSET)
#define STM32_RCC_APB1HRSTR    (STM32H5_RCC_BASE + STM32_RCC_APB1HRSTR_OFFSET)
#define STM32_RCC_APB2RSTR     (STM32H5_RCC_BASE + STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_APB3RSTR     (STM32H5_RCC_BASE + STM32_RCC_APB3RSTR_OFFSET)
#define STM32_RCC_AHB1ENR      (STM32H5_RCC_BASE + STM32_RCC_AHB1ENR_OFFSET)
#define STM32_RCC_AHB2ENR      (STM32H5_RCC_BASE + STM32_RCC_AHB2ENR_OFFSET)
#define STM32_RCC_AHB4ENR      (STM32H5_RCC_BASE + STM32_RCC_AHB4ENR_OFFSET)
#define STM32_RCC_APB1ENR1     (STM32H5_RCC_BASE + STM32_RCC_APB1ENR1_OFFSET)
#define STM32_RCC_APB1ENR2     (STM32H5_RCC_BASE + STM32_RCC_APB1ENR2_OFFSET)
#define STM32_RCC_APB2ENR      (STM32H5_RCC_BASE + STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_APB3ENR      (STM32H5_RCC_BASE + STM32_RCC_APB3ENR_OFFSET)
#define STM32_RCC_AHB1LPENR    (STM32H5_RCC_BASE + STM32_RCC_AHB1LPENR_OFFSET)
#define STM32_RCC_AHB2LPENR    (STM32H5_RCC_BASE + STM32_RCC_AHB2LPENR_OFFSET)
#define STM32_RCC_AHB4LPENR    (STM32H5_RCC_BASE + STM32_RCC_AHB4LPENR_OFFSET)
#define STM32_RCC_APB1LPENR1   (STM32H5_RCC_BASE + STM32_RCC_APB1LPENR1_OFFSET)
#define STM32_RCC_APB1LPENR2   (STM32H5_RCC_BASE + STM32_RCC_APB1LPENR2_OFFSET)
#define STM32_RCC_APB2LPENR    (STM32H5_RCC_BASE + STM32_RCC_APB2LPENR_OFFSET)
#define STM32_RCC_APB3LPENR    (STM32H5_RCC_BASE + STM32_RCC_APB3LPENR_OFFSET)
#define STM32_RCC_CCIPR1       (STM32H5_RCC_BASE + STM32_RCC_CCIPR1_OFFSET)
#define STM32_RCC_CCIPR2       (STM32H5_RCC_BASE + STM32_RCC_CCIPR2_OFFSET)
#define STM32_RCC_CCIPR3       (STM32H5_RCC_BASE + STM32_RCC_CCIPR3_OFFSET)
#define STM32_RCC_CCIPR4       (STM32H5_RCC_BASE + STM32_RCC_CCIPR4_OFFSET)
#define STM32_RCC_CCIPR5       (STM32H5_RCC_BASE + STM32_RCC_CCIPR5_OFFSET)
#define STM32_RCC_BDCR         (STM32H5_RCC_BASE + STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_RSR          (STM32H5_RCC_BASE + STM32_RCC_RSR_OFFSET)
#define STM32_RCC_SECCFGR      (STM32H5_RCC_BASE + STM32_RCC_SECCFGR_OFFSET)
#define STM32_RCC_PRIVCFGR     (STM32H5_RCC_BASE + STM32_RCC_PRIVCFGR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Clock control register */

#define RCC_CR_HSION                     (1 << 0)  /* Bit    0: Internal High Speed clock enable */
#define RCC_CR_HSIRDY                    (1 << 1)  /* Bit    1: Internal High Speed clock ready flag */
#define RCC_CR_HSIKERON                  (1 << 2)  /* Bit    2: HSI clock enable in Stop mode */
#define RCC_CR_HSIDIV_SHIFT              (3)       /* Bit [4:3] HSI Divider */
#define RCC_CR_HSIDIV_MASK               (0x3 << RCC_CR_HSIDIV_SHIFT) 
#define RCC_CR_HSIDIVF                   (1 << 5)  /* Bit    5: HSI divider flag */

#define RCC_CR_CSION                     (1 << 8)  /* Bit    8:  CSI clock enable */
#define RCC_CR_CSIRDY                    (1 << 9)  /* Bit    9:  CSI clock ready flag */
#define RCC_CR_CSIKERON                  (1 << 10) /* Bit    10: CSI clock enable in Stop mode */

#define RCC_CR_HSI48ON                   (1 << 12) /* Bit    12:  HSI48 clock enable */
#define RCC_CR_HSI48RDY                  (1 << 13) /* Bit    13:  HSI48 clock ready flag */

#define RCC_CR_HSEON                     (1 << 16) /* Bit    16:  HSE clock enable */
#define RCC_CR_HSERDY                    (1 << 17) /* Bit    17:  HSE clock ready flag */
#define RCC_CR_HSEBYP                    (1 << 18) /* Bit    18:  HSE clock bypass */
#define RCC_CR_HSECSSON                  (1 << 19) /* Bit    19:  HSE clock security system enable */
#define RCC_CR_HSEEXT                    (1 << 20) /* Bit    20:  HSE external high speed clock 
						                  type in bypass mode */
#define RCC_CR_PLL1ON                    (1 << 24) /* Bit    24: PLL1 enable */
#define RCC_CR_PLL1RDY                   (1 << 25) /* Bit    25: PLL1 clock ready flag */
#define RCC_CR_PLL2ON                    (1 << 26) /* Bit    26: PLL2 enable */
#define RCC_CR_PLL2RDY                   (1 << 27) /* Bit    27: PLL2 clock ready flag */
#define RCC_CR_PLL3ON                    (1 << 28) /* Bit    28: PLL3 enable */
#define RCC_CR_PLL3RDY                   (1 << 29) /* Bit    29: PLL3 clock ready flag */

/* HSI Calibration register */

#define RCC_HSICFGR_HSITRIM_SHIFT        (16)      /* Bits 22-16: Internal High Speed clock trimming */
#define RCC_HSICFGR_HSITRIM_MASK         (0x7f << RCC_HSICFGR_HSITRIM_SHIFT)
#define RCC_HSICFGR_HSICAL_SHIFT         (0)      /* Bits 11-0: Internal High Speed clock Calibration */
#define RCC_HSICFGR_HSICAL_MASK          (0xfff << RCC_HSICFGR_HSICAL_SHIFT)

