kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_PLL1CFGR_PLL1SRC_SHIFT          (0) /* Bits 1-0: Main PLL(PLL) and audio PLLs (PLLSAIx)
                                               * entry clock source */
#define RCC_PLL1CFGR_PLL1SRC_MASK           (3 << RCC_PLL1CFGR_PLL1SRC_SHIFT)
#  define RCC_PLL1CFGR_PLL1SRC_NONE         (0 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 000: No clock sent to PLLs */
#  define RCC_PLL1CFGR_PLL1SRC_HSI          (1 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 001: HSI selected as PLL source */
#  define RCC_PLL1CFGR_PLL1SRC_CSI          (2 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 010: CSI selected as PLL source */
#  define RCC_PLL1CFGR_PLL1SRC_HSE          (3 << RCC_PLL1CFGR_PLL1SRC_SHIFT) /* 011: HSE selected as PLL source */

#define RCC_PLL1CFGR_PLL1GRE_SHIFT          (2) /* Bit 3-2:  */
#define RCC_PLL1CFGR_PLL1RGE_MASK           (3 << RCC_PLL1CFGR_PLL1RGE_SHIFT)
#  define RCC_PLL1CFGR_PLL1RGE_NONE         (0 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 000: Input Clock Range Frequency 1-2 MHz */
#  define RCC_PLL1CFGR_PLL1RGE_HSI          (1 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 001: Input Clock Range Frequency 2-4 MHz */
#  define RCC_PLL1CFGR_PLL1RGE_CSI          (2 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 010: Input Clock Range Frequency 4-8 MHz **/
#  define RCC_PLL1CFGR_PLL1RGE_HSE          (3 << RCC_PLL1CFGR_PLL1RGE_SHIFT) /* 011: Input Clock Range Frequency 8-16 MHz **/

#define RCC_PLL1CFGR_PLL1FRACEN             (1 << 4) /* PLL1 Fractional Latch Enable */
#define RCC_PLL1CFGR_PLL1VCOSEL             (1 << 5) /* PLL1 VCO Selection */

#define RCC_PLL1CFGR_PLL1M_SHIFT            (8) /* Bit 13-8:  */
#define RCC_PLL1CFGR_PLL1M_MASK             (0x3f << RCC_PLL1CFGR_PLL1M_SHIFT)
#  define RCC_PLL1CFGR_PLL1M_DIS            (0 << RCC_PLL1CFGR_PLL1M_SHIFT)  /* 000000: Prescaler disabled */
#  define RCC_PLL1CFGR_PLL1M_d1             (1 << RCC_PLL1CFGR_PLL1M_SHIFT)  /* 000001: DIV1 */
#  define RCC_PLL1CFGR_PLL1M_d2             (2 << RCC_PLL1CFGR_PLL1M_SHIFT)  /* 000010: DIV2 */
#  define RCC_PLL1CFGR_PLL1M_d4             (4 << RCC_PLL1CFGR_PLL1M_SHIFT)  /* 000100: DIV4 */
#  define RCC_PLL1CFGR_PLL1M_d8             (8 << RCC_PLL1CFGR_PLL1M_SHIFT)  /* 001000: DIV8 */
#  define RCC_PLL1CFGR_PLL1M_d16            (16 << RCC_PLL1CFGR_PLL1M_SHIFT) /* 010000: DIV16 */
#  define RCC_PLL1CFGR_PLL1M_d32            (32 << RCC_PLL1CFGR_PLL1M_SHIFT) /* 100000: DIV32 */
#  define RCC_PLL1CFGR_PLL1M_d63            (63 << RCC_PLL1CFGR_PLL1M_SHIFT) /* 111111: DIV63 */

#define RCC_PLL1CFGR_PLL1PEN                (1 << 16) /* PLL1 DIVP divder output enable */
#define RCC_PLL1CFGR_PLL1QEN                (1 << 17) /* PLL1 DIVQ divder output enable */
#define RCC_PLL1CFGR_PLL1REN                (1 << 18) /* PLL1 DIVR divder output enable */

/* PLL2 configuration register */

#define RCC_PLL2CFGR_PLL2SRC_SHIFT          (0) /* Bits 1-0: Main PLL(PLL) and audio PLLs (PLLSAIx)
                                               * entry clock source */
#define RCC_PLL2CFGR_PLL2SRC_MASK           (3 << RCC_PLL2CFGR_PLL2SRC_SHIFT)
#  define RCC_PLL2CFGR_PLL2SRC_NONE         (0 << RCC_PLL2CFGR_PLL2SRC_SHIFT) /* 000: No clock sent to PLLs */
#  define RCC_PLL2CFGR_PLL2SRC_HSI          (1 << RCC_PLL2CFGR_PLL2SRC_SHIFT) /* 001: HSI selected as PLL source */
#  define RCC_PLL2CFGR_PLL2SRC_CSI          (2 << RCC_PLL2CFGR_PLL2SRC_SHIFT) /* 010: CSI selected as PLL source */
#  define RCC_PLL2CFGR_PLL2SRC_HSE          (3 << RCC_PLL2CFGR_PLL2SRC_SHIFT) /* 011: HSE selected as PLL source */

#define RCC_PLL2CFGR_PLL2GRE_SHIFT          (2) /* Bit 3-2:  */
#define RCC_PLL2CFGR_PLL2RGE_MASK           (3 << RCC_PLL2CFGR_PLL2RGE_SHIFT)
#  define RCC_PLL2CFGR_PLL2RGE_NONE         (0 << RCC_PLL2CFGR_PLL2RGE_SHIFT) /* 000: Input Clock Range Frequency 1-2 MHz */
#  define RCC_PLL2CFGR_PLL2RGE_HSI          (1 << RCC_PLL2CFGR_PLL2RGE_SHIFT) /* 001: Input Clock Range Frequency 2-4 MHz */
#  define RCC_PLL2CFGR_PLL2RGE_CSI          (2 << RCC_PLL2CFGR_PLL2RGE_SHIFT) /* 010: Input Clock Range Frequency 4-8 MHz **/
#  define RCC_PLL2CFGR_PLL2RGE_HSE          (3 << RCC_PLL2CFGR_PLL2RGE_SHIFT) /* 011: Input Clock Range Frequency 8-16 MHz **/

#define RCC_PLL2CFGR_PLL2FRACEN             (1 << 4) /* PLL2 Fractional Latch Enable */
#define RCC_PLL2CFGR_PLL2VCOSEL             (1 << 5) /* PLL2 VCO Selection */

#define RCC_PLL2CFGR_PLL2M_SHIFT            (8) /* Bit 13-8:  */
#define RCC_PLL2CFGR_PLL2M_MASK             (0x3f << RCC_PLL2CFGR_PLL2M_SHIFT)
#  define RCC_PLL2CFGR_PLL2M_DIS            (0 << RCC_PLL2CFGR_PLL2M_SHIFT)  /* 000000: Prescaler disabled */
#  define RCC_PLL2CFGR_PLL2M_d1             (1 << RCC_PLL2CFGR_PLL2M_SHIFT)  /* 000001: DIV1 */
#  define RCC_PLL2CFGR_PLL2M_d2             (2 << RCC_PLL2CFGR_PLL2M_SHIFT)  /* 000010: DIV2 */
#  define RCC_PLL2CFGR_PLL2M_d4             (4 << RCC_PLL2CFGR_PLL2M_SHIFT)  /* 000100: DIV4 */
#  define RCC_PLL2CFGR_PLL2M_d8             (8 << RCC_PLL2CFGR_PLL2M_SHIFT)  /* 001000: DIV8 */
#  define RCC_PLL2CFGR_PLL2M_d16            (16 << RCC_PLL2CFGR_PLL2M_SHIFT) /* 010000: DIV16 */
#  define RCC_PLL2CFGR_PLL2M_d32            (32 << RCC_PLL2CFGR_PLL2M_SHIFT) /* 100000: DIV32 */
#  define RCC_PLL2CFGR_PLL2M_d63            (63 << RCC_PLL2CFGR_PLL2M_SHIFT) /* 111111: DIV63 */

#define RCC_PLL2CFGR_PLL2PEN                (1 << 16) /* PLL2 DIVP divder output enable */
#define RCC_PLL2CFGR_PLL2QEN                (1 << 17) /* PLL2 DIVQ divder output enable */
#define RCC_PLL2CFGR_PLL2REN                (1 << 18) /* PLL2 DIVR divder output enable */

/* PLL3 configuration register */

#define RCC_PLL3CFGR_PLL3SRC_SHIFT          (0) /* Bits 1-0: Main PLL(PLL) and audio PLLs (PLLSAIx)
                                               * entry clock source */
#define RCC_PLL3CFGR_PLL3SRC_MASK           (3 << RCC_PLL3CFGR_PLL3SRC_SHIFT)
#  define RCC_PLL3CFGR_PLL3SRC_NONE         (0 << RCC_PLL3CFGR_PLL3SRC_SHIFT) /* 000: No clock sent to PLLs */
#  define RCC_PLL3CFGR_PLL3SRC_HSI          (1 << RCC_PLL3CFGR_PLL3SRC_SHIFT) /* 001: HSI selected as PLL source */
#  define RCC_PLL3CFGR_PLL3SRC_CSI          (2 << RCC_PLL3CFGR_PLL3SRC_SHIFT) /* 010: CSI selected as PLL source */
#  define RCC_PLL3CFGR_PLL3SRC_HSE          (3 << RCC_PLL3CFGR_PLL3SRC_SHIFT) /* 011: HSE selected as PLL source */

#define RCC_PLL3CFGR_PLL3GRE_SHIFT          (2) /* Bit 3-2:  */
#define RCC_PLL3CFGR_PLL3RGE_MASK           (3 << RCC_PLL3CFGR_PLL3RGE_SHIFT)
#  define RCC_PLL3CFGR_PLL3RGE_NONE         (0 << RCC_PLL3CFGR_PLL3RGE_SHIFT) /* 000: Input Clock Range Frequency 1-2 MHz */
#  define RCC_PLL3CFGR_PLL3RGE_HSI          (1 << RCC_PLL3CFGR_PLL3RGE_SHIFT) /* 001: Input Clock Range Frequency 2-4 MHz */
#  define RCC_PLL3CFGR_PLL3RGE_CSI          (2 << RCC_PLL3CFGR_PLL3RGE_SHIFT) /* 010: Input Clock Range Frequency 4-8 MHz **/
#  define RCC_PLL3CFGR_PLL3RGE_HSE          (3 << RCC_PLL3CFGR_PLL3RGE_SHIFT) /* 011: Input Clock Range Frequency 8-16 MHz **/

#define RCC_PLL3CFGR_PLL3FRACEN             (1 << 4) /* PLL3 Fractional Latch Enable */
#define RCC_PLL3CFGR_PLL3VCOSEL             (1 << 5) /* PLL3 VCO Selection */

#define RCC_PLL3CFGR_PLL3M_SHIFT            (8) /* Bit 13-8:  */
#define RCC_PLL3CFGR_PLL3M_MASK             (0x3f << RCC_PLL3CFGR_PLL3M_SHIFT)
#  define RCC_PLL3CFGR_PLL3M_DIS            (0 << RCC_PLL3CFGR_PLL3M_SHIFT)  /* 000000: Prescaler disabled */
#  define RCC_PLL3CFGR_PLL3M_d1             (1 << RCC_PLL3CFGR_PLL3M_SHIFT)  /* 000001: DIV1 */
#  define RCC_PLL3CFGR_PLL3M_d2             (2 << RCC_PLL3CFGR_PLL3M_SHIFT)  /* 000010: DIV2 */
#  define RCC_PLL3CFGR_PLL3M_d4             (4 << RCC_PLL3CFGR_PLL3M_SHIFT)  /* 000100: DIV4 */
#  define RCC_PLL3CFGR_PLL3M_d8             (8 << RCC_PLL3CFGR_PLL3M_SHIFT)  /* 001000: DIV8 */
#  define RCC_PLL3CFGR_PLL3M_d16            (16 << RCC_PLL3CFGR_PLL3M_SHIFT) /* 010000: DIV16 */
#  define RCC_PLL3CFGR_PLL3M_d32            (32 << RCC_PLL3CFGR_PLL3M_SHIFT) /* 100000: DIV32 */
#  define RCC_PLL3CFGR_PLL3M_d63            (63 << RCC_PLL3CFGR_PLL3M_SHIFT) /* 111111: DIV63 */

#define RCC_PLL3CFGR_PLL3PEN                (1 << 16) /* PLL3 DIVP divder output enable */
#define RCC_PLL3CFGR_PLL3QEN                (1 << 17) /* PLL3 DIVQ divder output enable */
#define RCC_PLL3CFGR_PLL3REN                (1 << 18) /* PLL3 DIVR divder output enable */

/* PLL1 dividers register */

