kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_PLL1DIVR_PLL1N_SHIFT            (0) /* Bits 8-0:  */
#define RCC_PLL1DIVR_PLL1N_MASK             (0x1ff << RCC_PLL1DIVR_PLL1N_SHIFT)
#  define RCC_PLL1DIVR_PLL1N_4              (0x003 << RCC_PLL1DIVR_PLL1N_SHIFT)  /* PLL1N = 4 */
#  define RCC_PLL1DIVR_PLL1N_5              (0x004 << RCC_PLL1DIVR_PLL1N_SHIFT)  /* PLL1N = 5 */
#  define RCC_PLL1DIVR_PLL1N_6              (0x005 << RCC_PLL1DIVR_PLL1N_SHIFT)  /* PLL1N = 6 */
#  define RCC_PLL1DIVR_PLL1N_6              (0x080 << RCC_PLL1DIVR_PLL1N_SHIFT)  /* PLL1N = 129 */
#  define RCC_PLL1DIVR_PLL1N_6              (0x1ff << RCC_PLL1DIVR_PLL1N_SHIFT)  /* PLL1N = 512 */

#define RCC_PLL1DIVR_PLL1P_SHIFT            (9) /* Bits 15-9:  */
#define RCC_PLL1DIVR_PLL1P_MASK             (0x7f << RCC_PLL1DIVR_PLL1P_SHIFT)
#  define RCC_PLL1DIVR_PLL1P_VCO1d2         (1 << RCC_PLL1DIVR_PLL1P_SHIFT)   /* 0000001: pll1_p_ck = vco1_ck / 2 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d4         (3 << RCC_PLL1DIVR_PLL1P_SHIFT)   /* 0000011: pll1_p_ck = vco1_ck / 4 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d8         (7 << RCC_PLL1DIVR_PLL1P_SHIFT)   /* 0000111: pll1_p_ck = vco1_ck / 8 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d16        (15 << RCC_PLL1DIVR_PLL1P_SHIFT)  /* 0001111: pll1_p_ck = vco1_ck / 16 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d32        (31 << RCC_PLL1DIVR_PLL1P_SHIFT)  /* 0011111: pll1_p_ck = vco1_ck / 32 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d64        (63 << RCC_PLL1DIVR_PLL1P_SHIFT)  /* 0111111: pll1_p_ck = vco1_ck / 64 */
#  define RCC_PLL1DIVR_PLL1P_VCO1d128       (127 << RCC_PLL1DIVR_PLL1P_SHIFT) /* 1111111: pll1_p_ck = vco1_ck / 128 */

#define RCC_PLL1DIVR_PLL1Q_SHIFT            (16) /* Bits 22-16:  */
#define RCC_PLL1DIVR_PLL1Q_MASK             (0x7f << RCC_PLL1DIVR_PLL1Q_SHIFT)
#  define RCC_PLL1DIVR_PLL1Q_VCO1d1         (0 << RCC_PLL1DIVR_PLL1Q_SHIFT)   /* 0000000: pll1_p_ck = vco1_ck / 1 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d2         (1 << RCC_PLL1DIVR_PLL1Q_SHIFT)   /* 0000001: pll1_p_ck = vco1_ck / 2 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d4         (3 << RCC_PLL1DIVR_PLL1Q_SHIFT)   /* 0000011: pll1_p_ck = vco1_ck / 4 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d8         (7 << RCC_PLL1DIVR_PLL1Q_SHIFT)   /* 0000111: pll1_p_ck = vco1_ck / 8 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d16        (15 << RCC_PLL1DIVR_PLL1Q_SHIFT)  /* 0001111: pll1_p_ck = vco1_ck / 16 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d32        (31 << RCC_PLL1DIVR_PLL1Q_SHIFT)  /* 0011111: pll1_p_ck = vco1_ck / 32 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d64        (63 << RCC_PLL1DIVR_PLL1Q_SHIFT)  /* 0111111: pll1_p_ck = vco1_ck / 64 */
#  define RCC_PLL1DIVR_PLL1Q_VCO1d128       (127 << RCC_PLL1DIVR_PLL1Q_SHIFT) /* 1111111: pll1_p_ck = vco1_ck / 128 */

#define RCC_PLL1DIVR_PLL1R_SHIFT            (24) /* Bits 30-24:  */
#define RCC_PLL1DIVR_PLL1R_MASK             (0x7f << RCC_PLL1DIVR_PLL1R_SHIFT)
#  define RCC_PLL1DIVR_PLL1R_VCO1d1         (0 << RCC_PLL1DIVR_PLL1R_SHIFT)   /* 0000000: pll1_p_ck = vco1_ck / 1 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d2         (1 << RCC_PLL1DIVR_PLL1R_SHIFT)   /* 0000001: pll1_p_ck = vco1_ck / 2 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d4         (3 << RCC_PLL1DIVR_PLL1R_SHIFT)   /* 0000011: pll1_p_ck = vco1_ck / 4 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d8         (7 << RCC_PLL1DIVR_PLL1R_SHIFT)   /* 0000111: pll1_p_ck = vco1_ck / 8 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d16        (15 << RCC_PLL1DIVR_PLL1R_SHIFT)  /* 0001111: pll1_p_ck = vco1_ck / 16 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d32        (31 << RCC_PLL1DIVR_PLL1R_SHIFT)  /* 0011111: pll1_p_ck = vco1_ck / 32 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d64        (63 << RCC_PLL1DIVR_PLL1R_SHIFT)  /* 0111111: pll1_p_ck = vco1_ck / 64 */
#  define RCC_PLL1DIVR_PLL1R_VCO1d128       (127 << RCC_PLL1DIVR_PLL1R_SHIFT) /* 1111111: pll1_p_ck = vco1_ck / 128 */

/* PLL2 dividers register */

#define RCC_PLL2DIVR_PLL2N_SHIFT            (0) /* Bits 8-0:  */
#define RCC_PLL2DIVR_PLL2N_MASK             (0x1ff << RCC_PLL2DIVR_PLL2N_SHIFT)
#  define RCC_PLL2DIVR_PLL2N_4              (0x003 << RCC_PLL2DIVR_PLL2N_SHIFT)  /* PLL2N = 4 */
#  define RCC_PLL2DIVR_PLL2N_5              (0x004 << RCC_PLL2DIVR_PLL2N_SHIFT)  /* PLL2N = 5 */
#  define RCC_PLL2DIVR_PLL2N_6              (0x005 << RCC_PLL2DIVR_PLL2N_SHIFT)  /* PLL2N = 6 */
#  define RCC_PLL2DIVR_PLL2N_6              (0x080 << RCC_PLL2DIVR_PLL2N_SHIFT)  /* PLL2N = 129 */
#  define RCC_PLL2DIVR_PLL2N_6              (0x1ff << RCC_PLL2DIVR_PLL2N_SHIFT)  /* PLL2N = 512 */

#define RCC_PLL2DIVR_PLL2P_SHIFT            (9) /* Bits 15-9:  */
#define RCC_PLL2DIVR_PLL2P_MASK             (0x7f << RCC_PLL2DIVR_PLL2P_SHIFT)
#  define RCC_PLL2DIVR_PLL2P_VCO1d2         (1 << RCC_PLL2DIVR_PLL2P_SHIFT)   /* 0000001: pll2_p_ck = vco1_ck / 2 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d4         (3 << RCC_PLL2DIVR_PLL2P_SHIFT)   /* 0000011: pll2_p_ck = vco1_ck / 4 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d8         (7 << RCC_PLL2DIVR_PLL2P_SHIFT)   /* 0000111: pll2_p_ck = vco1_ck / 8 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d16        (15 << RCC_PLL2DIVR_PLL2P_SHIFT)  /* 0001111: pll2_p_ck = vco1_ck / 16 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d32        (31 << RCC_PLL2DIVR_PLL2P_SHIFT)  /* 0011111: pll2_p_ck = vco1_ck / 32 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d64        (63 << RCC_PLL2DIVR_PLL2P_SHIFT)  /* 0111111: pll2_p_ck = vco1_ck / 64 */
#  define RCC_PLL2DIVR_PLL2P_VCO1d128       (127 << RCC_PLL2DIVR_PLL2P_SHIFT) /* 1111111: pll2_p_ck = vco1_ck / 128 */

#define RCC_PLL2DIVR_PLL2Q_SHIFT            (16) /* Bits 22-16:  */
#define RCC_PLL2DIVR_PLL2Q_MASK             (0x7f << RCC_PLL2DIVR_PLL2Q_SHIFT)
#  define RCC_PLL2DIVR_PLL2Q_VCO1d1         (0 << RCC_PLL2DIVR_PLL2Q_SHIFT)   /* 0000000: pll2_q_ck = vco1_ck / 1 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d2         (1 << RCC_PLL2DIVR_PLL2Q_SHIFT)   /* 0000001: pll2_q_ck = vco1_ck / 2 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d4         (3 << RCC_PLL2DIVR_PLL2Q_SHIFT)   /* 0000011: pll2_q_ck = vco1_ck / 4 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d8         (7 << RCC_PLL2DIVR_PLL2Q_SHIFT)   /* 0000111: pll2_q_ck = vco1_ck / 8 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d16        (15 << RCC_PLL2DIVR_PLL2Q_SHIFT)  /* 0001111: pll2_q_ck = vco1_ck / 16 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d32        (31 << RCC_PLL2DIVR_PLL2Q_SHIFT)  /* 0011111: pll2_q_ck = vco1_ck / 32 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d64        (63 << RCC_PLL2DIVR_PLL2Q_SHIFT)  /* 0111111: pll2_q_ck = vco1_ck / 64 */
#  define RCC_PLL2DIVR_PLL2Q_VCO1d128       (127 << RCC_PLL2DIVR_PLL2Q_SHIFT) /* 1111111: pll2_q_ck = vco1_ck / 128 */

#define RCC_PLL2DIVR_PLL2R_SHIFT            (24) /* Bits 30-24:  */
#define RCC_PLL2DIVR_PLL2R_MASK             (0x7f << RCC_PLL2DIVR_PLL2R_SHIFT)
#  define RCC_PLL2DIVR_PLL2R_VCO1d1         (0 << RCC_PLL2DIVR_PLL2R_SHIFT)   /* 0000000: pll2_r_ck = vco1_ck / 1 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d2         (1 << RCC_PLL2DIVR_PLL2R_SHIFT)   /* 0000001: pll2_r_ck = vco1_ck / 2 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d4         (3 << RCC_PLL2DIVR_PLL2R_SHIFT)   /* 0000011: pll2_r_ck = vco1_ck / 4 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d8         (7 << RCC_PLL2DIVR_PLL2R_SHIFT)   /* 0000111: pll2_r_ck = vco1_ck / 8 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d16        (15 << RCC_PLL2DIVR_PLL2R_SHIFT)  /* 0001111: pll2_r_ck = vco1_ck / 16 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d32        (31 << RCC_PLL2DIVR_PLL2R_SHIFT)  /* 0011111: pll2_r_ck = vco1_ck / 32 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d64        (63 << RCC_PLL2DIVR_PLL2R_SHIFT)  /* 0111111: pll2_r_ck = vco1_ck / 64 */
#  define RCC_PLL2DIVR_PLL2R_VCO1d128       (127 << RCC_PLL2DIVR_PLL2R_SHIFT) /* 1111111: pll2_r_ck = vco1_ck / 128 */

/* PLL3 dividers register */

