kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_AHB4ENR_OTFDEC1EN            (1 << 7)   /* Bit  7: OTFDEC1 clock enable */
#define RCC_AHB4ENR_SDMMC1EN             (1 << 11)  /* Bit 11: SDMMC1 clock enable */
#define RCC_AHB4ENR_SDMMC2EN             (1 << 12)  /* Bit 12: SDMMC2 clock enable */
#define RCC_AHB4ENR_FMCEN                (1 << 16)  /* Bit 16: Flexible memory controller module enable */
#define RCC_AHB4ENR_OCTOSPI1EN           (1 << 20)  /* Bit 20: OCTOSPI1 module enable */

/* APB1 Peripheral clock enable register 1 */

#define RCC_APB1LENR_TIM2EN            (1 << 0)  /* Bit 0:  TIM2 clock enable */
#define RCC_APB1LENR_TIM3EN            (1 << 1)  /* Bit 1:  TIM3 clock enable */
#define RCC_APB1LENR_TIM4EN            (1 << 2)  /* Bit 2:  TIM4 clock enable */
#define RCC_APB1LENR_TIM5EN            (1 << 3)  /* Bit 3:  TIM5 clock enable */
#define RCC_APB1LENR_TIM6EN            (1 << 4)  /* Bit 4:  TIM6 clock enable */
#define RCC_APB1LENR_TIM7EN            (1 << 5)  /* Bit 5:  TIM7 clock enable */
#define RCC_APB1LENR_TIM12EN           (1 << 6)  /* Bit 5:  TIM12 clock enable */
#define RCC_APB1LENR_TIM13EN           (1 << 7)  /* Bit 5:  TIM13 clock enable */
#define RCC_APB1LENR_TIM14EN           (1 << 8)  /* Bit 5:  TIM14 clock enable */
#define RCC_APB1LENR_SPI2EN            (1 << 14) /* Bit 14: SPI2 clock enable */
#define RCC_APB1LENR_SPI3EN            (1 << 15) /* Bit 15: SPI3 clock enable */
#define RCC_APB1LENR_USART2EN          (1 << 17) /* Bit 17: USART2 clock enable */
#define RCC_APB1LENR_USART3EN          (1 << 18) /* Bit 18: USART3 clock enable */
#define RCC_APB1LENR_UART4EN           (1 << 19) /* Bit 19: UART4 clock enable */
#define RCC_APB1LENR_UART5EN           (1 << 20) /* Bit 20: UART5 clock enable */
#define RCC_APB1LENR_I2C1EN            (1 << 21) /* Bit 21: I2C1 clock enable */
#define RCC_APB1LENR_I2C2EN            (1 << 22) /* Bit 22: I2C2 clock enable */
#define RCC_APB1LENR_I3C1EN            (1 << 23) /* Bit 23: I3C1 clock enable */
#define RCC_APB1LENR_CRSEN             (1 << 24) /* Bit 24: CRS clock enable */
#define RCC_APB1LENR_USART6EN          (1 << 25) /* Bit 25: USART6 clock enable */
#define RCC_APB1LENR_USART10EN         (1 << 26) /* Bit 26: USART10 clock enable */
#define RCC_APB1LENR_USART11EN         (1 << 27) /* Bit 27: USART11 clock enable */
#define RCC_APB1LENR_CRSEN             (1 << 28) /* Bit 28: CEC clock enable */
#define RCC_APB1LENR_UART7EN           (1 << 30) /* Bit 30: UART7 clock enable */
#define RCC_APB1LENR_UART8EN           (1 << 31) /* Bit 31: UART8 clock enable */

/* APB1 Peripheral clock enable register 2 */

#define RCC_APB1HENR_UART9EN           (1 << 0)  /* Bit 0:  UART9 clock enable */
#define RCC_APB1HENR_UART12EN          (1 << 1)  /* Bit 1:  UART12 clock enable */
#define RCC_APB1HENR_DTSEN             (1 << 3)  /* Bit 3:  DTS  clock enable */
#define RCC_APB1HENR_LPTIM2EN          (1 << 5)  /* Bit 5:  Low-power Timer 2 clock enable */
#define RCC_APB1HENR_FDCANEN           (1 << 9)  /* Bit 9:  FDCAN clock enable */
#define RCC_APB1HENR_UCPD1EN           (1 << 23) /* Bit 23: UCPD1 clock enable */

/* APB2 Peripheral clock enable register */

#define RCC_APB2ENR_TIM1EN             (1 << 11) /* Bit 11: TIM1 clock enable */
#define RCC_APB2ENR_SPI1EN             (1 << 12) /* Bit 12: SPI1 clock enable */
#define RCC_APB2ENR_TIM8EN             (1 << 13) /* Bit 13: TIM8 clock enable */
#define RCC_APB2ENR_USART1EN           (1 << 14) /* Bit 14: USART1 clock enable */
#define RCC_APB2ENR_TIM15EN            (1 << 16) /* Bit 16: TIM15 clock enable */
#define RCC_APB2ENR_TIM16EN            (1 << 17) /* Bit 17: TIM16 clock enable */
#define RCC_APB2ENR_TIM17EN            (1 << 18) /* Bit 18: TIM17 clock enable */
#define RCC_APB2ENR_SPI4EN             (1 << 19) /* Bit 19: SPI4 clock enable */
#define RCC_APB2ENR_SPI67EN            (1 << 20) /* Bit 20: SPI6 clock enable */
#define RCC_APB2ENR_SAI1EN             (1 << 21) /* Bit 21: SAI1 clock enable */
#define RCC_APB2ENR_SAI2EN             (1 << 22) /* Bit 22: SAI2 clock enable */
#define RCC_APB2ENR_USBEN              (1 << 24) /* Bit 24: USB clock enable */

/* APB3 Peripheral clock enable register */

#define RCC_APB3ENR_SBSEN              (1 << 1)  /* Bit 1: SBS clock enable */
#define RCC_APB3ENR_SPI5EN             (1 << 5)  /* Bit 5: SPI5 clock enable */
#define RCC_APB3ENR_LPUART1EN          (1 << 6)  /* Bit 6: LPUART1 clock enable */
#define RCC_APB3ENR_I2C3EN             (1 << 7)  /* Bit 7: I2C3 clock enable */
#define RCC_APB3ENR_I2C4EN             (1 << 8)  /* Bit 8: I2C4 clock enable */
#define RCC_APB3ENR_I3C2EN             (1 << 9)  /* Bit 9: I3C2 clock enable */
#define RCC_APB3ENR_LPTIM1EN           (1 << 11) /* Bit 11: LPTIM1 clock enable */
#define RCC_APB3ENR_LPTIM3EN           (1 << 12) /* Bit 12: LPTIM3 clock enable */
#define RCC_APB3ENR_LPTIM4EN           (1 << 13) /* Bit 13: LPTIM4 clock enable */
#define RCC_APB3ENR_LPTIM5EN           (1 << 14) /* Bit 14: LPTIM5 clock enable */
#define RCC_APB3ENR_LPTIM6EN           (1 << 15) /* Bit 15: LPTIM6 clock enable */
#define RCC_APB3ENR_VREFEN             (1 << 20) /* Bit 20: VREF clock enable */
#define RCC_APB3ENR_RTCAPBEN           (1 << 21) /* Bit 21: RTCABP clock enable */

/* RCC AHB1 Sleep and Stop modes peripheral clock enable register */

#define RCC_AHB1LPENR_GPDMA1LPEN             (1 << 0)  /* Bit 0:  GPDMA1 clock enable during sleep mode */
#define RCC_AHB1LPENR_GPDMA2LPEN             (1 << 1)  /* Bit 1:  GPDMA2 clock enable during sleep mode */
#define RCC_AHB1LPENR_FLITFLPEN              (1 << 8)  /* Bit 8:  Flash Interace clock enable during sleep mode */
#define RCC_AHB1LPENR_CRCLPEN                (1 << 12) /* Bit 12:  CRC clock enable during sleep mode */
#define RCC_AHB1LPENR_CORDICLPEN             (1 << 14) /* Bit 14:  CORDIC clock enable during sleep mode */
#define RCC_AHB1LPENR_FMACLPEN               (1 << 15) /* Bit 15:  FMAC clock enable during sleep mode */
#define RCC_AHB1LPENR_RAMCFGLPEN             (1 << 17) /* Bit 17:  RAMCFG clock enable during sleep mode */
#define RCC_AHB1LPENR_ETHLPEN                (1 << 19) /* Bit 19:  ETH clock enable during sleep mode */
#define RCC_AHB1LPENR_ETHTXLPEN              (1 << 20) /* Bit 20:  ETH TX clock enable during sleep mode */
#define RCC_AHB1LPENR_ETHRXLPEN              (1 << 21) /* Bit 21:  ETH RX clock enable during sleep mode */
#define RCC_AHB1LPENR_TZSC1LPEN              (1 << 24) /* Bit 24:  TZSC1 clock enable during sleep mode */
#define RCC_AHB1LPENR_BKPRAMLPEN             (1 << 28) /* Bit 28:  BKPRAM clock enable during sleep mode */
#define RCC_AHB1LPENR_DCACHELPEN             (1 << 30) /* Bit 25:  DCACHE clock enable during sleep mode */
#define RCC_AHB1LPENR_SRAM1LPEN              (1 << 31) /* Bit 25:  SRAM1 clock enable during sleep mode */


/* RCC AHB2 low power mode peripheral clock enable register */

#define RCC_AHB2LPENR_GPIOALPEN              (1 << 0)  /* Bit 0:  IO port A clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOBLPEN              (1 << 1)  /* Bit 1:  IO port B clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOCLPEN              (1 << 2)  /* Bit 2:  IO port C clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIODLPEN              (1 << 3)  /* Bit 3:  IO port D clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOELPEN              (1 << 4)  /* Bit 4:  IO port E clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOFLPEN              (1 << 5)  /* Bit 5:  IO port F clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOGLPEN              (1 << 6)  /* Bit 6:  IO port G clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOHLPEN              (1 << 7)  /* Bit 7:  IO port H clock enable during sleep mode */
#define RCC_AHB2LPENR_GPIOILPEN              (1 << 8)  /* Bit 8:  IO port I clock enable during sleep mode */
#define RCC_AHB2LPENR_ADCLPEN                (1 << 10) /* Bit 10: ADC interface enable (common to all ADCs) */
#define RCC_AHB2LPENR_DAC1LPEN               (1 << 11) /* Bit 11: DAC clock enable during sleep mode */
#define RCC_AHB2LPENR_DCMI_PSSILPEN          (1 << 12) /* Bit 12: Digital Camera Interface Clock Enable */
#define RCC_AHB2LPENR_AESLPEN                (1 << 16) /* Bit 16: AES Cryptographic module enable */
#define RCC_AHB2LPENR_HASHLPEN               (1 << 17) /* Bit 17: HASH module enable */
#define RCC_AHB2LPENR_RNGLPEN                (1 << 18) /* Bit 18: Random number generator module enable */
#define RCC_AHB2LPENR_PKALPEN                (1 << 19) /* Bit 19: PKA clock enable during sleep mode */
#define RCC_AHB2LPENR_SAESLPEN               (1 << 20) /* Bit 20: SAES clock enable during sleep mode */
#define RCC_AHB2LPENR_SRAM2LPEN              (1 << 30) /* Bit 30: SRAM2 clock enable during sleep mode */
#define RCC_AHB2LPENR_SRAM3LPEN              (1 << 31) /* Bit 30: SRAM2 clock enable during sleep mode */


