kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
/* RCC AHB4 low power mode peripheral clock enable register */

#define RCC_AHB4LPENR_OTFDEC1LPEN            (1 << 7)   /* Bit  7: OTFDEC1 clock enable during sleep mode */
#define RCC_AHB4LPENR_SDMMC1LPEN             (1 << 11)  /* Bit 11: SDMMC1 clock enable during sleep mode */
#define RCC_AHB4LPENR_SDMMC2LPEN             (1 << 12)  /* Bit 12: SDMMC2 clock enable during sleep mode */
#define RCC_AHB4LPENR_FMCLPEN                (1 << 16)  /* Bit 16: Flexible memory controller module enable */
#define RCC_AHB4LPENR_OCTOSPI1LPEN           (1 << 20)  /* Bit 20: OCTOSPI1 module clock enable during sleep mode */

/* APB1 Peripheral clock enable register 1 */

#define RCC_APB1LLPENR_TIM2LPEN            (1 << 0)  /* Bit 0:  TIM2 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM3LPEN            (1 << 1)  /* Bit 1:  TIM3 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM4LPEN            (1 << 2)  /* Bit 2:  TIM4 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM5LPEN            (1 << 3)  /* Bit 3:  TIM5 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM6LPEN            (1 << 4)  /* Bit 4:  TIM6 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM7LPEN            (1 << 5)  /* Bit 5:  TIM7 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM12LPEN           (1 << 6)  /* Bit 6:  TIM12 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM13LPEN           (1 << 7)  /* Bit 7:  TIM13 clock enable during sleep mode */
#define RCC_APB1LLPENR_TIM14LPEN           (1 << 8)  /* Bit 8:  TIM14 clock enable during sleep mode */
#define RCC_APB1LLPENR_WWDGLPEN            (1 << 11) /* Bit 11: WWDG clock enable during sleep mode */
#define RCC_APB1LLPENR_SPI2LPEN            (1 << 14) /* Bit 14: SPI2 clock enable during sleep mode */
#define RCC_APB1LLPENR_SPI3LPEN            (1 << 15) /* Bit 15: SPI3 clock enable during sleep mode */
#define RCC_APB1LLPENR_USART2LPEN          (1 << 17) /* Bit 17: USART2 clock enable during sleep mode */
#define RCC_APB1LLPENR_USART3LPEN          (1 << 18) /* Bit 18: USART3 clock enable during sleep mode */
#define RCC_APB1LLPENR_UART4LPEN           (1 << 19) /* Bit 19: UART4 clock enable during sleep mode */
#define RCC_APB1LLPENR_UART5LPEN           (1 << 20) /* Bit 20: UART5 clock enable during sleep mode */
#define RCC_APB1LLPENR_I2C1LPEN            (1 << 21) /* Bit 21: I2C1 clock enable during sleep mode */
#define RCC_APB1LLPENR_I2C2LPEN            (1 << 22) /* Bit 22: I2C2 clock enable during sleep mode */
#define RCC_APB1LLPENR_I3C1LPEN            (1 << 23) /* Bit 23: I3C1 clock enable during sleep mode */
#define RCC_APB1LLPENR_CRSLPEN             (1 << 24) /* Bit 24: CRS clock enable during sleep mode */
#define RCC_APB1LLPENR_USART6LPEN          (1 << 25) /* Bit 25: USART6 clock enable during sleep mode */
#define RCC_APB1LLPENR_USART10LPEN         (1 << 26) /* Bit 26: USART10 clock enable during sleep mode */
#define RCC_APB1LLPENR_USART11LPEN         (1 << 27) /* Bit 27: USART11 clock enable during sleep mode */
#define RCC_APB1LLPENR_CRSLPEN             (1 << 28) /* Bit 28: CEC clock enable during sleep mode */
#define RCC_APB1LLPENR_UART7LPEN           (1 << 30) /* Bit 30: UART7 clock enable during sleep mode */
#define RCC_APB1LLPENR_UART8LPEN           (1 << 31) /* Bit 31: UART8 clock enable during sleep mode */

/* APB1 Peripheral clock enable register 2 */

#define RCC_APB1HLPENR_UART9LPEN           (1 << 0)  /* Bit 0:  UART9 clock enable during sleep mode */
#define RCC_APB1HLPENR_UART12LPEN          (1 << 1)  /* Bit 1:  UART12 clock enable during sleep mode */
#define RCC_APB1HLPENR_DTSLPEN             (1 << 3)  /* Bit 3:  DTS  clock enable during sleep mode */
#define RCC_APB1HLPENR_LPTIM2LPEN          (1 << 5)  /* Bit 5:  Low-power Timer 2 clock enable during sleep mode */
#define RCC_APB1HLPENR_FDCANLPEN           (1 << 9)  /* Bit 9:  FDCAN clock enable during sleep mode */
#define RCC_APB1HLPENR_UCPD1LPEN           (1 << 23) /* Bit 23: UCPD1 clock enable during sleep mode */

/* APB2 Peripheral clock enable register */

#define RCC_APB2LPENR_TIM1LPEN             (1 << 11) /* Bit 11: TIM1 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI1LPEN             (1 << 12) /* Bit 12: SPI1 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM8LPEN             (1 << 13) /* Bit 13: TIM8 clock enable during sleep mode */
#define RCC_APB2LPENR_USART1LPEN           (1 << 14) /* Bit 14: USART1 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM15LPEN            (1 << 16) /* Bit 16: TIM15 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM16LPEN            (1 << 17) /* Bit 17: TIM16 clock enable during sleep mode */
#define RCC_APB2LPENR_TIM17LPEN            (1 << 18) /* Bit 18: TIM17 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI4LPEN             (1 << 19) /* Bit 19: SPI4 clock enable during sleep mode */
#define RCC_APB2LPENR_SPI67LPEN            (1 << 20) /* Bit 20: SPI6 clock enable during sleep mode */
#define RCC_APB2LPENR_SAI1LPEN             (1 << 21) /* Bit 21: SAI1 clock enable during sleep mode */
#define RCC_APB2LPENR_SAI2LPEN             (1 << 22) /* Bit 22: SAI2 clock enable during sleep mode */
#define RCC_APB2LPENR_USBLPEN              (1 << 24) /* Bit 24: USB clock enable during sleep mode */

/* APB3 Peripheral clock enable register */

#define RCC_APB3LPENR_SBSLPEN              (1 << 1)  /* Bit 1: SBS clock enable during sleep mode */
#define RCC_APB3LPENR_SPI5LPEN             (1 << 5)  /* Bit 5: SPI5 clock enable during sleep mode */
#define RCC_APB3LPENR_LPUART1LPEN          (1 << 6)  /* Bit 6: LPUART1 clock enable during sleep mode */
#define RCC_APB3LPENR_I2C3LPEN             (1 << 7)  /* Bit 7: I2C3 clock enable during sleep mode */
#define RCC_APB3LPENR_I2C4LPEN             (1 << 8)  /* Bit 8: I2C4 clock enable during sleep mode */
#define RCC_APB3LPENR_I3C2LPEN             (1 << 9)  /* Bit 9: I3C2 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM1LPEN           (1 << 11) /* Bit 11: LPTIM1 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM3LPEN           (1 << 12) /* Bit 12: LPTIM3 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM4LPEN           (1 << 13) /* Bit 13: LPTIM4 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM5LPEN           (1 << 14) /* Bit 14: LPTIM5 clock enable during sleep mode */
#define RCC_APB3LPENR_LPTIM6LPEN           (1 << 15) /* Bit 15: LPTIM6 clock enable during sleep mode */
#define RCC_APB3LPENR_VREFLPEN             (1 << 20) /* Bit 20: VREF clock enable during sleep mode */
#define RCC_APB3LPENR_RTCAPBLPEN           (1 << 21) /* Bit 21: RTCABP clock enable during sleep mode */


/* Kernel Clock Configuration register 1 */

