kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_CCIPR1_USART1SEL_SHIFT        (0)
#define RCC_CCIPR1_USART1SEL_MASK         (7 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_RCCPCLK1   (0 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_PLL2QCK    (1 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_PLL3QCK    (2 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_HSIKERCK   (3 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_CSIKERCK   (4 << RCC_CCIPR1_USART1SEL_SHIFT)
#  define RCC_CCIPR1_USART1SEL_LSECK      (5 << RCC_CCIPR1_USART1SEL_SHIFT)

#define RCC_CCIPR1_USART2SEL_SHIFT        (3)
#define RCC_CCIPR1_USART2SEL_MASK         (7 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_RCCPCLK1   (0 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_PLL2QCK    (1 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_PLL3QCK    (2 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_HSIKERCK   (3 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_CSIKERCK   (4 << RCC_CCIPR1_USART2SEL_SHIFT)
#  define RCC_CCIPR1_USART2SEL_LSECK      (5 << RCC_CCIPR1_USART2SEL_SHIFT)

#define RCC_CCIPR1_USART3SEL_SHIFT        (6)
#define RCC_CCIPR1_USART3SEL_MASK         (7 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_RCCPCLK1   (0 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_PLL2QCK    (1 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_PLL3QCK    (2 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_HSIKERCK   (3 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_CSIKERCK   (4 << RCC_CCIPR1_USART3SEL_SHIFT)
#  define RCC_CCIPR1_USART3SEL_LSECK      (5 << RCC_CCIPR1_USART3SEL_SHIFT)

#define RCC_CCIPR1_UART4SEL_SHIFT        (9)
#define RCC_CCIPR1_UART4SEL_MASK         (7 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_PLL2QCK    (1 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_PLL3QCK    (2 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_HSIKERCK   (3 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_CSIKERCK   (4 << RCC_CCIPR1_UART4SEL_SHIFT)
#  define RCC_CCIPR1_UART4SEL_LSECK      (5 << RCC_CCIPR1_UART4SEL_SHIFT)

#define RCC_CCIPR1_UART5SEL_SHIFT        (12)
#define RCC_CCIPR1_UART5SEL_MASK         (7 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_PLL2QCK    (1 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_PLL3QCK    (2 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_HSIKERCK   (3 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_CSIKERCK   (4 << RCC_CCIPR1_UART5SEL_SHIFT)
#  define RCC_CCIPR1_UART5SEL_LSECK      (5 << RCC_CCIPR1_UART5SEL_SHIFT)

#define RCC_CCIPR1_UART6SEL_SHIFT        (15)
#define RCC_CCIPR1_UART6SEL_MASK         (7 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_PLL2QCK    (1 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_PLL3QCK    (2 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_HSIKERCK   (3 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_CSIKERCK   (4 << RCC_CCIPR1_UART6SEL_SHIFT)
#  define RCC_CCIPR1_UART6SEL_LSECK      (5 << RCC_CCIPR1_UART6SEL_SHIFT)

#define RCC_CCIPR1_UART7SEL_SHIFT        (18)
#define RCC_CCIPR1_UART7SEL_MASK         (7 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_PLL2QCK    (1 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_PLL3QCK    (2 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_HSIKERCK   (3 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_CSIKERCK   (4 << RCC_CCIPR1_UART7SEL_SHIFT)
#  define RCC_CCIPR1_UART7SEL_LSECK      (5 << RCC_CCIPR1_UART7SEL_SHIFT)

#define RCC_CCIPR1_UART8SEL_SHIFT        (21)
#define RCC_CCIPR1_UART8SEL_MASK         (7 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_PLL2QCK    (1 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_PLL3QCK    (2 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_HSIKERCK   (3 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_CSIKERCK   (4 << RCC_CCIPR1_UART8SEL_SHIFT)
#  define RCC_CCIPR1_UART8SEL_LSECK      (5 << RCC_CCIPR1_UART8SEL_SHIFT)

#define RCC_CCIPR1_UART9SEL_SHIFT        (24)
#define RCC_CCIPR1_UART9SEL_MASK         (7 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_RCCPCLK1   (0 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_PLL2QCK    (1 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_PLL3QCK    (2 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_HSIKERCK   (3 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_CSIKERCK   (4 << RCC_CCIPR1_UART9SEL_SHIFT)
#  define RCC_CCIPR1_UART9SEL_LSECK      (5 << RCC_CCIPR1_UART9SEL_SHIFT)

#define RCC_CCIPR1_USART10SEL_SHIFT       (27)
#define RCC_CCIPR1_USART10SEL_MASK        (7 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_RCCPCLK1  (0 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_PLL2QCK   (1 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_PLL3QCK   (2 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_HSIKERCK  (3 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_CSIKERCK  (4 << RCC_CCIPR1_USART10SEL_SHIFT)
#  define RCC_CCIPR1_USART10SEL_LSECK     (5 << RCC_CCIPR1_USART10SEL_SHIFT)

#define RCC_CCIPR1_TIMICSEL               (1 << 31)

/* Kernel Clock Configuration register 2 */

#define RCC_CCIPR2_USART11SEL_SHIFT        (0)
#define RCC_CCIPR2_USART11SEL_MASK         (7 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_RCCPCLK1   (0 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_PLL2QCK    (1 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_PLL3QCK    (2 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_HSIKERCK   (3 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_CSIKERCK   (4 << RCC_CCIPR2_USART11SEL_SHIFT)
#  define RCC_CCIPR2_USART11SEL_LSECK      (5 << RCC_CCIPR2_USART11SEL_SHIFT)

#define RCC_CCIPR2_USART12SEL_SHIFT        (4)
#define RCC_CCIPR2_USART12SEL_MASK         (7 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_RCCPCLK1   (0 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_PLL2QCK    (1 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_PLL3QCK    (2 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_HSIKERCK   (3 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_CSIKERCK   (4 << RCC_CCIPR2_USART12SEL_SHIFT)
#  define RCC_CCIPR2_USART12SEL_LSECK      (5 << RCC_CCIPR2_USART12SEL_SHIFT)

