kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_CCIPR2_LPTIM1SEL_SHIFT         (8)
#define RCC_CCIPR2_LPTIM1SEL_MASK          (7 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM1SEL_LSECK       (5 << RCC_CCIPR2_LPTIM1SEL_SHIFT)

#define RCC_CCIPR2_LPTIM2SEL_SHIFT         (12)
#define RCC_CCIPR2_LPTIM2SEL_MASK          (7 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_RCCPCLK1    (0 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM2SEL_LSECK       (5 << RCC_CCIPR2_LPTIM2SEL_SHIFT)

#define RCC_CCIPR2_LPTIM3SEL_SHIFT         (16)
#define RCC_CCIPR2_LPTIM3SEL_MASK          (7 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM3SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM3SEL_LSECK       (5 << RCC_CCIPR2_LPTIM3SEL_SHIFT)

#define RCC_CCIPR2_LPTIM4SEL_SHIFT         (20)
#define RCC_CCIPR2_LPTIM4SEL_MASK          (7 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM4SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM4SEL_LSECK       (5 << RCC_CCIPR2_LPTIM4SEL_SHIFT)

#define RCC_CCIPR2_LPTIM5SEL_SHIFT         (24)
#define RCC_CCIPR2_LPTIM5SEL_MASK          (7 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM5SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM5SEL_LSECK       (5 << RCC_CCIPR2_LPTIM5SEL_SHIFT)

#define RCC_CCIPR2_LPTIM6SEL_SHIFT         (28)
#define RCC_CCIPR2_LPTIM6SEL_MASK          (7 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_RCCPCLK3    (0 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_PLL2PCK     (1 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_PLL3RCK     (2 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_HSIKERCK    (3 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_CSIKERCK    (4 << RCC_CCIPR2_LPTIM6SEL_SHIFT)
#  define RCC_CCIPR2_LPTIM6SEL_LSECK       (5 << RCC_CCIPR2_LPTIM6SEL_SHIFT)

/* Kernel Clock Configuration register 3 */

#define RCC_CCIPR3_SPI1SEL_SHIFT         (0)
#define RCC_CCIPR3_SPI1SEL_MASK          (7 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI1SEL_SHIFT)
#  define RCC_CCIPR3_SPI1SEL_PERCKv      (4 << RCC_CCIPR3_SPI1SEL_SHIFT)

#define RCC_CCIPR3_SPI2SEL_SHIFT         (3)
#define RCC_CCIPR3_SPI2SEL_MASK          (7 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI2SEL_SHIFT)
#  define RCC_CCIPR3_SPI2SEL_PERCKv      (4 << RCC_CCIPR3_SPI2SEL_SHIFT)

#define RCC_CCIPR3_SPI3SEL_SHIFT         (6)
#define RCC_CCIPR3_SPI3SEL_MASK          (7 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL1QCK     (0 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL2PCK     (1 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PLL3PCK     (2 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_AUDIOCK     (3 << RCC_CCIPR3_SPI3SEL_SHIFT)
#  define RCC_CCIPR3_SPI3SEL_PERCKv      (4 << RCC_CCIPR3_SPI3SEL_SHIFT)

#define RCC_CCIPR3_SPI4SEL_SHIFT         (9)
#define RCC_CCIPR3_SPI4SEL_MASK          (7 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_RCCPCLK1    (0 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI4SEL_SHIFT)
#  define RCC_CCIPR3_SPI4SEL_HSECK       (5 << RCC_CCIPR3_SPI4SEL_SHIFT)

#define RCC_CCIPR3_SPI5SEL_SHIFT         (12)
#define RCC_CCIPR3_SPI5SEL_MASK          (7 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_RCCPCLK3    (0 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI5SEL_SHIFT)
#  define RCC_CCIPR3_SPI5SEL_HSECK       (5 << RCC_CCIPR3_SPI5SEL_SHIFT)

#define RCC_CCIPR3_SPI6SEL_SHIFT         (15)
#define RCC_CCIPR3_SPI6SEL_MASK          (7 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_RCCPCLK2    (0 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_PLL2QCK     (1 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_PLL3QCK     (2 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_HSIKERCK    (3 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_CSIKERCK    (4 << RCC_CCIPR3_SPI6SEL_SHIFT)
#  define RCC_CCIPR3_SPI6SEL_HSECK       (5 << RCC_CCIPR3_SPI6SEL_SHIFT)

#define RCC_CCIPR3_LPUART1SEL_SHIFT         (24)
#define RCC_CCIPR3_LPUART1SEL_MASK          (7 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_RCCPCLK3    (0 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_PLL2QCK     (1 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_PLL3QCK     (2 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_HSIKERCK    (3 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_CSIKERCK    (4 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_LSECK       (5 << RCC_CCIPR3_LPUART1SEL_SHIFT)

