kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
/* Kernel Clock Configuration register 4 */

#define RCC_CCIPR4_OCTOSPI1SEL_SHIFT        (0)
#define RCC_CCIPR4_OCTOSPI1SEL_MASK         (3 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_RCCHCLK4   (0 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PLL1QCK    (1 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PLL2RCK    (2 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)
#  define RCC_CCIPR4_OCTOSPI1SEL_PERCK   (3 << RCC_CCIPR4_OCTOSPI1SEL_SHIFT)

#define RCC_CCIPR4_SYSTICKSEL_SHIFT        (2)
#define RCC_CCIPR4_SYSTICKSEL_MASK         (3 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_RCCHCLKd8  (0 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_LSIKERCK1  (1 << RCC_CCIPR4_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR4_SYSTICKSEL_LSICK1     (2 << RCC_CCIPR4_SYSTICKSEL_SHIFT)

#define RCC_CCIPR4_USBSEL_SHIFT        (4)
#define RCC_CCIPR4_USBSEL_MASK         (3 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_NOCK       (0 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_PLL1QCK    (1 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_PLL3QCK    (2 << RCC_CCIPR4_USBSEL_SHIFT)
#  define RCC_CCIPR4_USBSEL_HSI48KERCK (3 << RCC_CCIPR4_USBSEL_SHIFT)

#define RCC_CCIPR4_SDMMC1SEL           (1 << 6)
#define RCC_CCIPR4_SDMMC2SEL           (1 << 7)

#define RCC_CCIPR4_I2C1SEL_SHIFT        (16)
#define RCC_CCIPR4_I2C1SEL_MASK         (3 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_RCCPCLK1   (0 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C1SEL_SHIFT)
#  define RCC_CCIPR4_I2C1SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C1SEL_SHIFT)

#define RCC_CCIPR4_I2C2SEL_SHIFT        (18)
#define RCC_CCIPR4_I2C2SEL_MASK         (3 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_RCCPCLK1   (0 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C2SEL_SHIFT)
#  define RCC_CCIPR4_I2C2SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C2SEL_SHIFT)

#define RCC_CCIPR4_I2C3SEL_SHIFT        (20)
#define RCC_CCIPR4_I2C3SEL_MASK         (3 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_RCCPCLK3   (0 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C3SEL_SHIFT)
#  define RCC_CCIPR4_I2C3SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C3SEL_SHIFT)

#define RCC_CCIPR4_I2C4SEL_SHIFT        (22)
#define RCC_CCIPR4_I2C4SEL_MASK         (3 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_RCCPCLK3   (0 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_PLL3RCK    (1 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_HSIKERCK   (2 << RCC_CCIPR4_I2C4SEL_SHIFT)
#  define RCC_CCIPR4_I2C4SEL_CSIKERCK   (3 << RCC_CCIPR4_I2C4SEL_SHIFT)

#define RCC_CCIPR4_I3C1SEL_SHIFT        (24)
#define RCC_CCIPR4_I3C1SEL_MASK         (3 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_RCCPCLK1   (0 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_PLL3RCK    (1 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_HSIKERCK   (2 << RCC_CCIPR4_I3C1SEL_SHIFT)
#  define RCC_CCIPR4_I3C1SEL_NOCK       (3 << RCC_CCIPR4_I3C1SEL_SHIFT)

#define RCC_CCIPR4_I3C2SEL_SHIFT        (24)
#define RCC_CCIPR4_I3C2SEL_MASK         (3 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_RCCPCLK1   (0 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_PLL3RCK    (1 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_HSIKERCK   (2 << RCC_CCIPR4_I3C2SEL_SHIFT)
#  define RCC_CCIPR4_I3C2SEL_NOCK       (3 << RCC_CCIPR4_I3C2SEL_SHIFT)

/* Kernel Clock Configuration register 5 */

#define RCC_CCIPR5_ADCDACSEL_SHIFT        (0)
#define RCC_CCIPR5_ADCDACSEL_MASK         (7 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_RCCHCLK    (0 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_SYSCK      (1 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_PLL2RCK    (2 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_HSECK      (3 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_HSEKERCK   (4 << RCC_CCIPR5_ADCDACSEL_SHIFT)
#  define RCC_CCIPR5_ADCDACSEL_CSIKERCK   (4 << RCC_CCIPR5_ADCDACSEL_SHIFT)

#define RCC_CCIPR5_DACSEL                 (1 << 3)

#define RCC_CCIPR5_RNGSEL_SHIFT        (4)
#define RCC_CCIPR5_RNGSEL_MASK         (3 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_HSI48KERCK (0 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_PLL1QCK    (1 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_LSECK      (2 << RCC_CCIPR5_RNGSEL_SHIFT)
#  define RCC_CCIPR5_RNGSEL_LSIKERCK   (3 << RCC_CCIPR5_RNGSEL_SHIFT)

#define RCC_CCIPR5_CECSEL_SHIFT          (6)
#define RCC_CCIPR5_CECSEL_MASK           (3 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_LSECK        (0 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_LSIKERCK     (1 << RCC_CCIPR5_CECSEL_SHIFT)
#  define RCC_CCIPR5_CECSEL_CSIKERCKd122 (2 << RCC_CCIPR5_CECSEL_SHIFT)

#define RCC_CCIPR5_FDCANSEL_SHIFT      (8)
#define RCC_CCIPR5_FDCANSEL_MASK       (3 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_HSECK    (0 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_PLL1QCK  (1 << RCC_CCIPR5_FDCANSEL_SHIFT)
#  define RCC_CCIPR5_FDCANSEL_PLL2QCK  (2 << RCC_CCIPR5_FDCANSEL_SHIFT)

#define RCC_CCIPR5_SAI1SEL_SHIFT        (16)
#define RCC_CCIPR5_SAI1SEL_MASK         (7 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL1QCK    (0 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL2PCK    (1 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PLL3PCK    (2 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_AUDIOCLK   (3 << RCC_CCIPR5_SAI1SEL_SHIFT)
#  define RCC_CCIPR5_SAI1SEL_PERCK      (4 << RCC_CCIPR5_SAI1SEL_SHIFT)

#define RCC_CCIPR5_SAI2SEL_SHIFT        (19)
#define RCC_CCIPR5_SAI2SEL_MASK         (7 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL1QCK    (0 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL2PCK    (1 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PLL3PCK    (2 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_AUDIOCLK   (3 << RCC_CCIPR5_SAI2SEL_SHIFT)
#  define RCC_CCIPR5_SAI2SEL_PERCK      (4 << RCC_CCIPR5_SAI2SEL_SHIFT)

