kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_rcc.h
#define RCC_CCIPR5_CKPERSEL_SHIFT       (30)
#define RCC_CCIPR5_CKPERSEL_MASK        (3 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_HSIKERCK  (0 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_CSIKERCK  (1 << RCC_CCIPR5_CKPERSEL_SHIFT)
#  define RCC_CCIPR5_CKPERSEL_HSECK     (2 << RCC_CCIPR5_CKPERSEL_SHIFT)

/* Backup domain control register */

#define RCC_BDCR_LSEON                   (1 << 0)  /* Bit 0: External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY                  (1 << 1)  /* Bit 1: External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP                  (1 << 2)  /* Bit 2: External Low Speed oscillator Bypass */

#define RCC_BDCR_LSEDRV_SHIFT            (3)       /* Bits 3-4: LSE oscillator drive capability */
#define RCC_BDCR_LSEDRV_MASK             (3 << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW            (0 << RCC_BDCR_LSEDRV_SHIFT) /* 00: Lower driving capability */
#  define RCC_BDCR_LSEDRV_MEDLO          (1 << RCC_BDCR_LSEDRV_SHIFT) /* 01: Medium Low driving capability */
#  define RCC_BDCR_LSEDRV_MEDHI          (2 << RCC_BDCR_LSEDRV_SHIFT) /* 10: Medium High driving capability*/
#  define RCC_BDCR_LSEDRV_HIGH           (3 << RCC_BDCR_LSEDRV_SHIFT) /* 11: Higher driving capability */

#define RCC_BDCR_LSECSSON                (1 << 5) /* Bit 5: CSS on LSE enable */
#define RCC_BDCR_LSECSSD                 (1 << 6) /* Bit 6: CSS on LSE failure Detection */
#define RCC_BDCR_LSEEXT                  (1 << 7) /* Bit 7: LSE external clock type in bypass mode */

#define RCC_BDCR_RTCSEL_SHIFT            (8)       /* Bits 9:8: RTC clock source selection */
#define RCC_BDCR_RTCSEL_MASK             (3 << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NOCLK          (0 << RCC_BDCR_RTCSEL_SHIFT) /* 00: No clock */
#  define RCC_BDCR_RTCSEL_LSE            (1 << RCC_BDCR_RTCSEL_SHIFT) /* 01: LSE oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_LSI            (2 << RCC_BDCR_RTCSEL_SHIFT) /* 10: LSI oscillator clock used as RTC clock */
#  define RCC_BDCR_RTCSEL_HSE            (3 << RCC_BDCR_RTCSEL_SHIFT) /* 11: HSE oscillator clock divided by 32 used as RTC clock */

#define RCC_BDCR_RTCEN                   (1 << 15)         /* Bit 15: RTC clock enable */
#define RCC_BDCR_VSWRST                  (1 << 16)         /* Bit 16: VSwitch domain software reset */
#define RCC_BDCR_LSCOEN                  (1 << 24)         /* Bit 24: Low speed clock output enable */
#define RCC_BDCR_LSCOSEL                 (1 << 25)         /* Bit 25: Low speed clock output selection */
#  define RCC_BCDR_LSCOSEL_LSI           0                 /* LSI selected */
#  define RCC_BDCR_LSCOSEL_LSE           RCC_BDCR_LSCOSEL  /* LSE selected */

#define RCC_BDCR_LSION                   (1 << 26)         /* Bit 26: LSI Oscillator Enable */
#define RCC_BDCR_LSIRDY                  (1 << 27)         /* Bit 27: LSI Oscillator Ready */

/* Reset status register */

#define RCC_RSR_RMVF                     (1 << 23) /* Bit 23: Remove reset flag */
#define RCC_RSR_PINRSTF                  (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_RSR_BORRSTF                  (1 << 27) /* Bit 27: BOR reset flag */
#define RCC_RSR_SFTRSTF                  (1 << 28) /* Bit 28: Software Reset flag */
#define RCC_RSR_IWDGRSTF                 (1 << 29) /* Bit 29: Independent Watchdog reset flag */
#define RCC_RSR_WWDGRSTF                 (1 << 30) /* Bit 30: Window watchdog reset flag */
#define RCC_RSR_LPWRRSTF                 (1 << 31) /* Bit 31: Low-Power reset flag */

/* Secure Configuration Register */

#define RCC_SECCFGR_HSISEC               (1 << 0) /* HSI clock configuration and status bits security */ 
#define RCC_SECCFGR_HSESEC               (1 << 1) /* HSE clock configuration and status bits security */ 
#define RCC_SECCFGR_CSISEC               (1 << 2) /* CSI clock configuration and status bits security */ 
#define RCC_SECCFGR_LSISEC               (1 << 3) /* LSI clock configuration and status bits security */ 
#define RCC_SECCFGR_LSESEC               (1 << 4) /* LSE clock configuration and status bits security */ 
#define RCC_SECCFGR_SYSCLKSEC            (1 << 5) /* SYSCLK configuration and status bits security */ 
#define RCC_SECCFGR_PRESCSEC             (1 << 6) /* PRESC configuration and status bits security */ 
#define RCC_SECCFGR_PLL1SEC              (1 << 7) /* PLL1 configuration and status bits security */ 
#define RCC_SECCFGR_PLL2SEC              (1 << 8) /* PLL2 configuration and status bits security */ 
#define RCC_SECCFGR_PLL3SEC              (1 << 9) /* PLL3 configuration and status bits security */ 
#define RCC_SECCFGR_HSI48SEC             (1 << 11) /* HSI48 configuration and status bits security */ 
#define RCC_SECCFGR_RMVRST               (1 << 12) /* Remove Reset flag security */ 
#define RCC_SECCFGR_CKPERSELSEC          (1 << 13) /* PER_CK selection security */

/* Privilege Configuration Register */

#define RCC_PRIVCFGR_SPRIV               (1 << 0) /* Secure functions privilege configuration */
#define RCC_PRIVCFGR_NSPRIV              (1 << 1) /* Non-secure functions privilege configuration */

#endif /* CONFIG_STM32H5_STM32H562XX */
#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H562XX_RCC_H */
